# Замени меня полностью
# На вход программе подается строка текста. Напишите программу, которая заменяет все вхождения цифры 1 на слово «one».

# Формат входных данных
# На вход программе подается строка текста.

# Формат выходных данных
# Программа должна вывести текст в соответствии с условием задачи.

# s = '1 for all and all for 1'
print(input().replace("1", "one"))
