# Код Морзе
# Код Морзе для представления цифр и букв использует тире и точки.

# Напишите программу для кодирования текстового сообщения в соответствии с кодом Морзе.

letters = [c for c in 'ABCDEFGHIJKLMNOPQRSTUVWXYZ0123456789']
morse = ['.-', '-...', '-.-.', '-..', '.', '..-.', '--.', '....', '..', '.---', '-.-', '.-..', '--', '-.', '---', '.--.', '--.-', '.-.', '...', '-', '..-', '...-', '.--', '-..-', '-.--', '--..', '-----', '.----', '..---', '...--', '....-', '.....', '-....', '--...', '---..', '----.']

m = input().upper()

dict1 = dict(zip(letters, morse))

for i in m:
    if i in dict1.keys():
        print(dict1[i], end=' ')
