# Симметричная матрица
# Напишите программу проверки симметричности квадратной матрицы относительно побочной диагонали.

# Формат входных данных
# На вход программе подаётся натуральное число n — количество строк и столбцов в матрице, затем элементы матрицы.

# Формат выходных данных
# Программа должна вывести YES, если матрица симметрична, и слово NO в противном случае.
# '''

# 🟢🟢🟢🟢🟢🟢 Main 🟢🟢🟢🟢🟢🟢

n = int(input())
matrix = [input().split() for i in range(n)]
is_sim = 'YES'

for i in range(n):
    for j in range(n - i):
        if matrix[i][j] != matrix[-j - 1][-i - 1]:
            is_sim = 'NO'
            break

print(is_sim)




# 🤔🤔🤔🤔 Test 🤔🤔🤔🤔

# n = 4
# matrix = [
#     [1, 2, 3, 4],
#     [5, 6, 7, 3],
#     [8, 9, 6, 2],
#     [4, 8, 5, 1]]
# n = 5
# matrix = [
#     [1, 2, 3, 4, 5],
#     [6, 7, 8, 9, 10],
#     [11, 12, 13, 14, 15],
#     [16, 17, 18, 19, 20],
#     [21, 22, 23, 24, 25]]
# is_sim = 'YES'

# for i in range(n):
#     for j in range(n - i):
#         if matrix[i][j] != matrix[-j - 1][-i - 1]:
#             is_sim = 'NO'
#             break

# print(is_sim)








